import React from 'react';
import { Link } from 'react-router-dom';

const Home = () => {
    return (
        <div className="home-container">
            <h1>Ласкаво просимо до нашого автосалону!</h1>
            <p>
                Ми раді представити вам наш широкий асортимент автомобілів, які задовольнять будь-які ваші потреби.
                Від стильних міських автомобілів до потужних позашляховиків — у нас є все!
            </p>
            <p>
                Наша команда професіоналів завжди готова допомогти вам з вибором і надати всю необхідну інформацію,
                щоб ви могли зробити найкраще рішення.
                Приєднуйтусь до нас у подорожі світом автомобілів!
            </p>
            <h2>Чому обирають нас?</h2>
            <ul>
                <li>Великий вибір автомобілів на будь-який смак і бюджет.</li>
                <li>Конкурентоспроможні ціни та спеціальні пропозиції.</li>
                <li>Професійна консультація та підтримка на всіх етапах покупки.</li>
                <li>Висока якість обслуговування клієнтів.</li>
            </ul>
            <p>
                Готові знайти свій ідеальний автомобіль? Перегляньте наші <Link to="/cars">автомобілі</Link> та дізнайтеся більше!
            </p>
        </div>
    );
};

export default Home;
